src/cf/Catalogs/уатМоделиАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатМоделиАгрегатов</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаШирина</Name>
					<Comment>Ширина шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныШирина</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаВысота</Name>
					<Comment>Высота шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныВысота</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаДиаметр</Name>
					<Comment>Диаметр шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныРадиус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаИндексНагрузки</Name>
					<Comment>Индекс нагрузки шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныПрофиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаИндексСкорости</Name>
					<Comment>Индекс скорости шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныИндексыСкорости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаСезонность</Name>
					<Comment>Сезонность шины</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатСезонностьШин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаТипКонструкции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыКонструкцииШин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаПробега</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЗатрат</Name>
					<Comment>Норма затрат, % от стоимости на количество единиц выработки.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Емкость</Name>
					<Comment>Емкость</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатЕмкостьАккумуляторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСлужбы</Name>
					<Comment>Срок службы агрегата, месяцев</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНачисленияИзноса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВариантыНачисленияИзносаАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиНачисленияИзноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИзмерениеИзносаВЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатВариантыНачисленияИзносаАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВариантыНачисленияИзносаАгрегатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Период</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачислять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатМоделиАгрегатов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Элементы.ГруппаУчетВыработки.Видимость = Ложь;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	МассивПараметров = Новый Массив(7);
	МассивПараметров[0] = ""; МассивПараметров[1] = "";
	МассивПараметров[2] = ""; МассивПараметров[3] = "";
	МассивПараметров[4] = ""; МассивПараметров[5] = "";
	МассивПараметров[6] = "";
	ВремНаименование = Врег(Объект.Наименование);
	Индекс=0;
	Пока СтрДлина(ВремНаименование) > 0 Цикл
		// Удалим лидирующие пробелы
		Пока СтрДлина(ВремНаименование) > 0 И Лев(ВремНаименование, 1) = " " Цикл
			ВремНаименование = Сред(ВремНаименование, 2);
		КонецЦикла;
		// Выберем очередной параметр
		Пока СтрДлина(ВремНаименование) > 0 И Лев(ВремНаименование, 1) <> " " И Лев(ВремНаименование, 1) <> "/" Цикл
			МассивПараметров[Индекс] = МассивПараметров[Индекс] + Лев(ВремНаименование, 1);
			ВремНаименование = Сред(ВремНаименование, 2);
		КонецЦикла;
		// Удалим пробелы до разделителя
		Пока СтрДлина(ВремНаименование) > 0 И Лев(ВремНаименование, 1) = " " Цикл
			ВремНаименование = Сред(ВремНаименование, 2);
		КонецЦикла;
		// Удалим и сам разделитель
		Если СтрДлина(ВремНаименование) > 0 И Лев(ВремНаименование, 1) = "/" Тогда
			ВремНаименование = Сред(ВремНаименование, 2);
		КонецЕсли;
		// Перейдем к следующему параметру
		Индекс = Индекс + 1;
		// Проверка на перебор всех параметров
		Если Индекс = 7 Тогда
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	ИзменениеНаименованияСервер(МассивПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ТипАгрегатаПриИзменении(Элемент)
	
	Объект.ШинаШирина      = ПредопределенноеЗначение("Справочник.уатШиныШирина.ПустаяСсылка");
	Объект.ШинаВысота      = ПредопределенноеЗначение("Справочник.уатШиныВысота.ПустаяСсылка");
	Объект.ШинаДиаметр     = ПредопределенноеЗначение("Справочник.уатШиныРадиус.ПустаяСсылка");
	Объект.ШинаИндексНагрузки    = ПредопределенноеЗначение("Справочник.уатШиныПрофиль.ПустаяСсылка");
	Объект.ШинаИндексСкорости    = ПредопределенноеЗначение("Справочник.уатШиныИндексыСкорости.ПустаяСсылка");
	Объект.ШинаТипКонструкции    = 0;
	Объект.ШинаДополнительнаяИнформация = "";
	Объект.ШинаСезонность = 0;
	Объект.Емкость        = 0;
	
	УстановитьВидимость();
	ЗаполнитьПараметрВыработки();
	
КонецПроцедуры

&НаКлиенте
Процедура ШинаШиринаПриИзменении(Элемент)
	ФормированиеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура ШинаВысотаПриИзменении(Элемент)
	ФормированиеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура ШинаДиаметрПриИзменении(Элемент)
	ФормированиеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура ШинаИндексНагрузкиПриИзменении(Элемент)
	ФормированиеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	ФормированиеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура ПроизводительПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ТипАгрегата) 
		И Объект.ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") тогда
		ФормированиеНаименования();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШинаТипКонструкцииПриИзменении(Элемент)
	ФормированиеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура ШинаИндексСкоростиПриИзменении(Элемент)
	ФормированиеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура ШинаДополнительнаяИнформацияПриИзменении(Элемент)
	ФормированиеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура ШинаСезонностьПриИзменении(Элемент)
	ФормированиеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ВариантНачисленияИзносаПриИзменении(Элемент)
	
	Если Объект.ВариантНачисленияИзноса = ПредопределенноеЗначение("Перечисление.уатВариантыНачисленияИзносаАгрегатов.Период") Тогда
		Объект.ПараметрВыработкиНачисленияИзноса = Неопределено;
		Объект.НормаПробега = 0;
	ИначеЕсли Объект.ВариантНачисленияИзноса = ПредопределенноеЗначение("Перечисление.уатВариантыНачисленияИзносаАгрегатов.НеНачислять") Тогда
		Объект.ПараметрВыработкиНачисленияИзноса = Неопределено;
		Объект.НормаПробега = 0;
		Объект.НормаЗатрат = 0;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

&НаКлиенте
Процедура РассчитатьНормуЗатрат(Команда)
	
	Если Объект.ВариантНачисленияИзноса = ПредопределенноеЗначение("Перечисление.уатВариантыНачисленияИзносаАгрегатов.Период") Тогда
		Если Объект.СрокСлужбы = 0 Тогда
			ТекстНСТР = НСтр("en = 'To calculate the cost rate by periods, you need to specify the service life.'; ru = 'Для расчета нормы затрат по периодам нужно указать срок службы.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Иначе
			Объект.НормаЗатрат = 1 / Объект.СрокСлужбы *100;
		КонецЕсли;
	Иначе
		Если Объект.НормаПробега = 0 Тогда
			ТекстНСТР = НСтр("en = 'To calculate the production cost rate, you need to specify the production rate.'; ru = 'Для расчета нормы затрат по выработке нужно указать норму выработки.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Иначе
			Объект.НормаЗатрат = 1 / Объект.НормаПробега *100 *1000;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ФормированиеНаименования()
	Объект.Наименование= СокрЛП(
		СокрЛП(Объект.Производитель)+" "+
		СокрЛП(Объект.Модель)+" "+
		СокрЛП(Объект.ШинаШирина)+"/"+
		СокрЛП(Объект.ШинаВысота)+" "+
		СокрЛП(Объект.ШинаТипКонструкции)+
		СокрЛП(Объект.ШинаДиаметр)+" "+
		СокрЛП(Объект.ШинаИндексНагрузки)+" "+
		СокрЛП(Объект.ШинаИндексСкорости)+" "+
		СокрЛП(Объект.ШинаСезонность)+" "+
		СокрЛП(Объект.ШинаДополнительнаяИнформация));
КонецПроцедуры

&НаСервере
Процедура ИзменениеНаименованияСервер(МассивПараметров)
// Найдем параметры в соответствующих справочниках
	//Ширина
	Если НЕ ПустаяСтрока(МассивПараметров[2]) Тогда
		// Параметр задан
		НоваяШирина = Справочники.уатШиныШирина.НайтиПоНаименованию(МассивПараметров[2], Ложь);
		Если (НоваяШирина <> Неопределено) И (НЕ уатОбщегоНазначения.уатЗначениеНеЗаполнено(НоваяШирина)) Тогда
			ШинаШирина = НоваяШирина;
		КонецЕсли; 
	КонецЕсли; 
	//Высота
	Если НЕ ПустаяСтрока(МассивПараметров[3]) Тогда
		// Параметр задан
		НоваяВысота = Справочники.уатШиныВысота.НайтиПоНаименованию(МассивПараметров[3], Ложь);
		Если (НоваяВысота <> Неопределено) И (НЕ уатОбщегоНазначения.уатЗначениеНеЗаполнено(НоваяВысота)) Тогда
			ШинаВысота = НоваяВысота;
		КонецЕсли; 
	КонецЕсли; 
	//Диаметр
	Если НЕ ПустаяСтрока(МассивПараметров[4]) И СтрДлина(МассивПараметров[4]) > 2 Тогда
		// Параметр задан
		Диаметр = Прав(МассивПараметров[4],СтрДлина(МассивПараметров[4])-1);
		НовыйДиаметр = Справочники.уатШиныРадиус.НайтиПоНаименованию(Диаметр, Ложь);
		Если (НовыйДиаметр <> Неопределено) И (НЕ уатОбщегоНазначения.уатЗначениеНеЗаполнено(НовыйДиаметр)) Тогда
			ШинаДиаметр = НовыйДиаметр;
		КонецЕсли; 
	КонецЕсли; 
	// Индекс скорости
	Если НЕ ПустаяСтрока(МассивПараметров[6]) Тогда
		// Параметр задан
		НовыйИндексСкорости = Справочники.уатШиныИндексыСкорости.НайтиПоНаименованию(МассивПараметров[6], Ложь);
		Если (НовыйИндексСкорости <> Неопределено) И (НЕ уатОбщегоНазначения.уатЗначениеНеЗаполнено(НовыйИндексСкорости)) Тогда
			ШинаИндексСкорости = НовыйИндексСкорости;
		КонецЕсли; 
	КонецЕсли; 
	//Индекс Нагрузки
	Если НЕ ПустаяСтрока(МассивПараметров[5]) Тогда
		// Параметр задан
		НовыйИндексНагрузки = Справочники.уатШиныПрофиль.НайтиПоНаименованию(МассивПараметров[5], Ложь);
		Если (НовыйИндексНагрузки <> Неопределено) И (НЕ уатОбщегоНазначения.уатЗначениеНеЗаполнено(НовыйИндексНагрузки)) Тогда
			ШинаИндексНагрузки = НовыйИндексНагрузки;
		КонецЕсли; 
	КонецЕсли; 
	// Сезонность не трогаем
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Объект.ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Аккумулятор") тогда
		Элементы.ГруппаАккумуляторы.Видимость = Истина;
		Элементы.ГруппаШины.Видимость         = Ложь;
	ИначеЕсли Объект.ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") тогда
		Элементы.ГруппаАккумуляторы.Видимость = Ложь;
		Элементы.ГруппаШины.Видимость         = Истина;
	Иначе
		Элементы.ГруппаАккумуляторы.Видимость = Ложь;
		Элементы.ГруппаШины.Видимость         = Ложь;
	КонецЕсли;
	
	Если Объект.ВариантНачисленияИзноса = ПредопределенноеЗначение("Перечисление.уатВариантыНачисленияИзносаАгрегатов.Выработка") Тогда
		Элементы.ПараметрВыработкиНачисленияИзноса.Видимость = Истина;
		Элементы.НормаВыработки.Видимость = Истина;
		Элементы.ГруппаНормаЗатрат.Видимость = Истина;
	ИначеЕсли Объект.ВариантНачисленияИзноса = ПредопределенноеЗначение("Перечисление.уатВариантыНачисленияИзносаАгрегатов.Период") Тогда
		Элементы.ПараметрВыработкиНачисленияИзноса.Видимость = Ложь;
		Элементы.НормаВыработки.Видимость = Ложь;
		Элементы.ГруппаНормаЗатрат.Видимость = Истина;
	Иначе
		Элементы.ПараметрВыработкиНачисленияИзноса.Видимость = Ложь;
		Элементы.НормаВыработки.Видимость = Ложь;
		Элементы.ГруппаНормаЗатрат.Видимость = Ложь;
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрВыработки()
	
	ВариантПоставкиСТД = уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД();
	
	Если Не ВариантПоставкиСТД Тогда
		Если ТипЗнч(Объект.ТипАгрегата) = Тип("СправочникСсылка.уатТипыАгрегатов") Тогда
			ПараметрВыработки = Объект.ТипАгрегата.ПараметрВыработки;
			Объект.ПараметрВыработки = ?(ЗначениеЗаполнено(ПараметрВыработки), ПараметрВыработки, Справочники.уатПараметрыВыработки.ПустаяСсылка()); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
